performance.yaml
# performance.yaml
execution:
  - executor: blazemeter
    concurrency: 2      # simulate 50 users
    ramp-up: 30s         # gradually start users in 30 seconds
    hold-for: 1m         # run test for 1 minute
    scenario: simple_ui

scenarios:
  simple_ui:
    requests:
      - url: http://3.134.95.55:5000/   # <-- replace with your .NET page URL
        method: GET

modules:
  cloud:
    username: harish99c@gmail.com
    token: 65890d8d20637b68ab315dc0d2ba6960fbf04964432691b3eb25742c03d9abf5a29ecabc

reporting:
  - module: blazemeter

# Optional: Fail GitHub Actions if page is slow
passfail:
  - criteria:
      - avg-rt > 500ms for 30s   # fail if average response > 500ms
    fail: true